import type { TimelineTopic } from "./types";

export const testTopics: TimelineTopic[] = [
    {
        name: 'IT',
        startYear: 1995,
        endYear: 2005,
        events: [
            {
                year: 1995,
                name: 'Выпуск Windows 95, популяризировавшего графический интерфейс',
            },
            {
                year: 1998,
                name: 'Основание Google, запуск поисковой системы',
            },
            {
                year: 2000,
                name: 'Запуск платформы для разработки .NET Framework от Microsoft',
            },
            {
                year: 2003,
                name: 'Создание системы управления версиями Git',
            },
            {
                year: 2004,
                name: 'Запуск социальной сети Facebook',
            },
        ],
    },
    {
        name: 'Gamedev',
        startYear: 2015,
        endYear: 2025,
        events: [
            {
                year: 2015,
                name: 'Выпуск игры The Witcher 3: Wild Hunt, установившей новые стандарты RPG',
            },
            {
                year: 2016,
                name: 'Выход Pokemon GO, популяризировавшей AR-игры',
            },
            {
                year: 2019,
                name: 'Запуск Google Stadia, облачной игровой платформы',
            },
            {
                year: 2020,
                name: 'Релиз Cyberpunk 2077, одного из самых ожидаемых проектов',
            },
            {
                year: 2023,
                name: 'Выпуск Baldur’s Gate 3, возродившей классические CRPG',
            },
            {
                year: 2024,
                name: 'Появление Unreal Engine 5.2 с улучшенной технологией Nanite',
            },
        ],
    },
    {
        name: 'Технологии',
        startYear: 2005,
        endYear: 2015,
        events: [
            {
                year: 2007,
                name: 'Выпуск первого iPhone от Apple',
            },
            {
                year: 2010,
                name: 'Запуск облачной платформы Amazon Web Services EC2',
            },
            {
                year: 2014,
                name: 'Появление первых потребительских дронов DJI Phantom',
            },
            {
                year: 2006,
                name: 'Запуск платформы Twitter',
            },
            {
                year: 2012,
                name: 'Выпуск Raspberry Pi, доступного одноплатного компьютера',
            },
            {
                year: 2015,
                name: 'Презентация первого потребительского шлема виртуальной реальности Oculus Rift',
            },
        ],
    },
    {
        name: 'Медицина',
        startYear: 2010,
        endYear: 2020,
        events: [
            {
                year: 2012,
                name: 'Одобрение первой CAR-T терапии для лечения рака',
            },
            {
                year: 2016,
                name: 'CRISPR-Cas9 впервые использован для редактирования генома человека',
            },
            {
                year: 2020,
                name: 'Разработка вакцин против COVID-19',
            },
            {
                year: 2013,
                name: 'Создание первого искусственного сердца для трансплантации',
            },
            {
                year: 2018,
                name: 'Одобрение первой генной терапии Luxturna для лечения наследственной слепоты',
            },
        ],
    },
    {
        name: 'Экология',
        startYear: 2000,
        endYear: 2010,
        events: [
            {
                year: 2001,
                name: 'Подписание Киотского протокола по сокращению выбросов парниковых газов',
            },
            {
                year: 2007,
                name: 'Запуск программы по восстановлению коралловых рифов',
            },
            {
                year: 2009,
                name: 'Копенгагенская конференция по климату',
            },
            {
                year: 2005,
                name: 'Введение в действие Киотского протокола',
            },
            {
                year: 2008,
                name: 'Запуск глобальной инициативы по защите тропических лесов REDD+',
            },
        ],
    },
    {
        name: 'Искусство и культура',
        startYear: 1990,
        endYear: 2000,
        events: [
            {
                year: 1993,
                name: 'Выход фильма «Парк Юрского периода»',
            },
            {
                year: 1997,
                name: 'Премьера мюзикла «Король Лев» на Бродвее',
            },
            {
                year: 1999,
                name: 'Запуск платформы Napster для обмена музыкой',
            },
            {
                year: 1991,
                name: 'Выход альбома Nirvana «Nevermind», популяризировавшего гранж',
            },
            {
                year: 1995,
                name: 'Открытие музея Гуггенхайма в Бильбао',
            },
            {
                year: 2000,
                name: 'Премьера фильма «Гладиатор», возродившего жанр исторического эпоса',
            },
        ],
    },
];
